# Pandas -2

In [1]:
import pandas as pd

In [2]:
titanic=pd.read_csv(r'C:/Users/admin/dataset/train.csv')

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Columns 추출하기
- [] 사용하기

In [7]:
titanic['Pclass'].head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

### 앞의 2개 데이터만 꺼내오고 싶을때는 Slicing사용하기

In [10]:
titanic[:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## Boolean Indexing

In [13]:
titanic[titanic['Pclass']==3].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

## iloc[]
- 위치 기반 인덱싱
- integer값을 넣어야함
- 슬라이싱, 팬시 인덱싱은 제공
- boolean인덱싱은 제공하지 X

In [16]:
data={'Name':['A','B','C','D'],
    'Year':[2011,2016,2015,2015],
    'Gender': ['Male','Female','Male','Male']
}

In [17]:
datadf=pd.DataFrame(data, index=['one','two','three','four'])

In [18]:
datadf

      Name  Year  Gender
one      A  2011    Male
two      B  2016  Female
three    C  2015    Male
four     D  2015    Male

In [19]:
datadf.iloc[0,0]

'A'

- 위치인덱싱이 아닌 명칭을 입력했으므로 오류 발생

In [20]:
datadf[0,'Name']

KeyError: (0, 'Name')

## loc[]
- 명칭 기반 데이터 추출
- 행 위치 => index 값 && 열 위치 => column명

In [21]:
datadf.loc['one','Name']

'A'

In [22]:
datadf.loc[:,'Name']

one      A
two      B
three    C
four     D
Name: Name, dtype: object

## Example (Boolean Indexing)
- and 조건일 때는 &
- or 조건일 때는 |
- not 조건일 때는 ~

<br/>

#### 1) 승객 중 Age>=60인 데이터 추출

In [24]:
age60=titanic[titanic['Age']>=60]
age60.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S

#### 2) 60세 이상인 승객의 나이와 이름 추출
- column이 2개 이상이므로 [[]] 두번 써줘야함

In [28]:
titanic[titanic['Age']>=60][['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

#### 3) 60세 이상 & 선실 등급이 1등급 & 여성인 승객 추출

In [30]:
# 방법 1
titanic[(titanic['Age']>=60) & (titanic['Pclass']==1) & (titanic['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [31]:
# 방법 2
cond1=titanic['Age']>=60
cond2=titanic['Pclass']==1
cond3= titanic['Sex']=='female'
titanic[cond1 & cond2 & cond3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

## Sort_values()
- DataFrame & Series의 정렬위해 사용
- Options
    - by : 해당 column으로 정렬 수행
    - ascending : True => 오름차순 , False => 내림차순
    - inplace : True => 정렬결과를 저장
  <br>  
  
  <br/>
- 여러개의 column으로 정렬하고 싶은 경우 by에 list형식으로 써주면 됌

In [36]:
sortdf=titanic.sort_values(by=['Name'])
sortdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.00,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.00,NaN,C

In [37]:
sortdf=titanic.sort_values(by=['Pclass','Name'], ascending=False)
sortdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5,NaN,S
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,345572,17.4,NaN,S

## Aggregation 함수 
- DataFrame에서 Aggregation 함수 적용 시 모든 column에 대해 적용
- 특정 column에 적용하려면 대상 column만 추출해야함

In [41]:
titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [42]:
titanic[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

## Groupby()
- by : 해당 column으로 groupby
- groupby() 후 반환된 결과에 aggregation 함수 호출하면   
    => 대상 column 제외하고 모든 column에 aggregation 적용

In [48]:
groupbydf=titanic.groupby(by='Pclass') # groupby 객체 반환
groupbydf

In [49]:
groupbydf=titanic.groupby(by='Pclass').count()
groupbydf

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [50]:
# 2개 column에만 count함수 수행
groupbydf=titanic.groupby('Pclass')[['PassengerId','Survived']].count()
groupbydf

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

### agg(aggregation함수)
- 여러개에 대해서 aggregation 하고 싶을 때는 agg() 사용함
- 여러개의 column이 서로 다른 aggregation함수 사용하는 경우 dictionary형태로 사용

In [52]:
titanic.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [55]:
# dictionary 형태 사용
agg_format={'Age':'max','SibSp':'sum','Fare':'mean'}
titanic.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

## 결손 데이터 처리
- column에 값이 없는 경우 (NaN, Null)
- 머신러닝 알고리즘은 Nan값을 처리하지 X
- 평균, 총합 등의 함수 연산 시 제외

<br/>

- isna() : NaN 여부 확인
- fillna() : Nan값을 다른 값으로 대체

### isna()
- 모든 column값이 NaN인지 True/False로 알려줌

In [57]:
titanic.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

#### 결손 데이터의 갯수 (sum이용)

In [59]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### fillna()
- 결손 데이터 대체
- inplace=True 해야지 실제 데이터 세트 값이 변경됌

In [61]:
# 1) Cabin의 Nan값을 'C000'으로 대체
titanic['Cabin']=titanic['Cabin'].fillna('C000')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C000,S

In [62]:
# 2) Age의 NaN값을 평균 나이로
titanic['Age']=titanic['Age'].fillna(titanic['Age'].mean())

In [63]:
# 3) Embarked의 Nan값을 S로 대체
titanic['Embarked']=titanic['Embarked'].fillna('S')

In [64]:
titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

## Apply Lambda 식으로 데이터 가공

### Lambda 식
- if/else 지원
- elif는 지원 X
- switch문을 쓰고 싶은 경우에는 함수를 따로 만들어줘야함

In [67]:
# 1) Name column의 문자열 갯수를 Name_len에 생성
titanic['Name_len']=titanic['Name'].apply(lambda x: len(x))
titanic[['Name_len','Name']].head()

   Name_len                                               Name
0        23                            Braund, Mr. Owen Harris
1        51  Cumings, Mrs. John Bradley (Florence Briggs Th...
2        22                             Heikkinen, Miss. Laina
3        44       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4        24                           Allen, Mr. William Henry

In [68]:
# 2) age<15면 chlid, 아니면 Adult로 구분 
titanic['Child_adult']=titanic['Age'].apply(lambda x: 'Child' if x<=15 else 'Adult')
titanic[['Child_adult','Age']].head()

  Child_adult   Age
0       Adult  22.0
1       Adult  38.0
2       Adult  26.0
3       Adult  35.0
4       Adult  35.0

In [72]:
# 3) age<15면 chlid, 15~60 Adult, 60~ Elderly로 분류
titanic['Age_Cat']=titanic['Age'].apply(lambda x: 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))

In [73]:
titanic['Age_Cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_Cat, dtype: int64

In [74]:
# 나이에 따라 분류를 세분화
def get_category(age):
    cat=""
    if age<=5: cat='Baby'
    elif age<=12: cat='Child'
    elif age<=18: cat='Teenager'
    elif age<=25: cat='Student'
    elif age<=35: cat='Young Adult'
    elif age<=60: cat='Adult'
    else: cat='Elderly'
    return cat

In [75]:
titanic['Age_cat']=titanic['Age'].apply(lambda x: get_category(x))
titanic[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult